Repository: Iwwww/vocabulary-testing-site
Catalog: mysite/locale/*/LC_MESSAGES/django.po
Languages: ru

source: Django Documentation
ru: Документация Django

source: On Testing Methods at the Vocabulary Website
ru: О методах тестирования на сайте Вокабулярий

source: One of the main methods for assessing vocabulary is the use of tests based on the Modern Theory of Testing (Item Response Theory, IRT). These methods allow for the consideration of not only the number of known words but also their complexity. The Rasch Model and its variations (e.g., 1PL, 2PL, 3PL) are widely used for assessing vocabulary.
ru: Одним из основных методов оценки словарного запаса является использование тестов, основанных на Современной теории тестов (Item Response Theory, IRT). Эти методы позволяют учитывать не только количество известных слов, но и их сложность. Модель Раша (Rasch Model) и его вариации (например, 1PL, 2PL, 3PL) широко применяются для оценки словарного запаса.

source: In the Rasch Model (1PL), the probability of correctly answering a word depends on the test-taker's ability level and the word's difficulty, represented by the parameter
ru: В модели Раша (1PL) вероятность правильного ответа на слово зависит от уровня способности испытуемого и сложности слова, представленной параметром

source: Where:
ru: Где:

source: \( P_i(\theta) \) - the probability of correctly answering word i for a test-taker with ability level \( \theta \).
ru: \( P_i(\theta) \) - вероятность правильного ответа на слово i для испытуемого с уровнем способности \( \theta \).

source: the test-taker's ability level.
ru: уровень способности испытуемого.

source: the difficulty parameter of word i.
ru: параметр сложности слова i.

source: An important tool for assessing vocabulary is frequency dictionaries. A frequency dictionary contains information about the frequency of words in a text corpus. Based on the assumption that more frequently occurring words are easier for most native speakers, frequency dictionaries allow for the assessment of word difficulty and use this information in test construction and vocabulary analysis.
ru: Важным инструментом для оценки словарного запаса являются частотные словари. Частотный словарь содержит информацию о частоте встречаемости слов в корпусе текстов. Основываясь на предположении, что более часто встречающиеся слова более просты для большинства носителей языка, частотные словари позволяют оценить сложность слов и использовать эту информацию при составлении тестов и анализе словарного запаса.

source: Word difficulty can be determined using its frequency of occurrence. The frequency of occurrence \( Freq(ipm) \) can be inversely proportional to its difficulty \( b_i \), as represented by the following formula:
ru: Для определения сложности слова может использоваться частота его встречаемости. Частота встречаемости слова \( Freq(ipm) \) может быть инверсно пропорциональна его сложности \( b_i \), что представлено следующей формулой:

source: However, potential inaccuracies in vocabulary assessment should be considered. For example, some words may have a high frequency due to specific usage contexts, which may not always reflect their overall difficulty. It is also important to consider that test-takers' abilities can affect test results, and individual ability differences should be taken into account when interpreting results.
ru: Однако стоит учитывать возможные погрешности при оценке словарного запаса. Например, некоторые слова могут иметь высокую частоту встречаемости из-за специфического контекста использования, что не всегда отражает их общую сложность. Также важно учитывать, что способности испытуемых могут влиять на результаты тестирования, и необходимо принимать во внимание различия в индивидуальных способностях при интерпретации результатов.

source: Our Tools
ru: Наши инструменты

source: On our website, you will find tools to assess your vocabulary based on modern research methods and frequency dictionaries. We provide tests based on IRT models and resources for working with frequency dictionaries. Our methods will help you not only measure your vocabulary but also identify areas for improvement and development.
ru: На нашем сайте вы найдете инструменты для оценки вашего словарного запаса на основе современных методов исследования и частотных словарей. Мы предоставляем тесты, основанные на моделях IRT, а также ресурсы для работы с частотными словарями. Наши методы помогут вам не только измерить ваш словарный запас, но и определить области для его улучшения и развития.

source: Test your vocabular
ru: Проверь словарный запас

source: Test length
ru: Длина теста

source: Short (20 words)
ru: Короткий (20 слов)

source: Medium (40 words)
ru: Средний (40 слов)

source: Long (80 words)
ru: Длинный (80 слов)

source: Choose target language
ru: Выберете языка

source: No languages available
ru: Нет доступных языков

source: Your vocabular is
ru: Ваш словарный запас

source: Reset
ru: Сбросить

source: Know
ru: Знаю

source: Don't know
ru: Не знаю

source: Word count tested:
ru: Количество протестированных слов:

source: Open main menu
ru: Открыть главное меню

source: Home page
ru: Главная

source: About
ru: О сайте

source: Anonymous statistics are collected on the site
ru: На сайте собирается анонимная статистика
